---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEnd1Elevation
source: html/74c37398-abb6-e955-8325-41ae9ce34ffc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEnd1Elevation Property

"End Level Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamEnd1Elevation { get; }
```